{
    "timelineItems": [
        {
            "country": "Malaysia",
            "startDate": "2023-12-31",
            "duration": "6 days",
            "description": "My epic bicycle trip kicked off with an early breakfast and a send-off from friends. Day one was a bumpy ride through kampung roads, then a bit scary on Kapar Road with cars speeding by. It was super hot, and my butt was already hurting from lack of sleep. I learned to be a bit 'thick skin' to find accommodation, sleeping in front of a kind restaurant owner's house. Day two was more of the same, with sweat, mosquitoes, and a painful butt, plus a 10km detour due to a closed bridge. We quickly realized 120km a day might be too much! By day three, we decided to relax a bit, enjoying a surprisingly fast ride to Taiping and some delicious local food like nasi lemak. Our bikes needed some TLC—my gears were loose, and Mei Yee's handlebar belt came off, so we took a rest day to get them fixed. My parents weren't thrilled about the trip initially, but after seeing my determination, they started to come around, even bragging to their customers about it. We then braved night cycling with new blinkers, stopped for dim sum (KL's is better, just saying), and battled crazy drivers in an industrial area. We even got a super kind stranger to offer us drinks and bread, which was really touching. Finally, we reached Changlun, our last stop in Malaysia, ready for the next chapter in Thailand!"
        },
        {
            "country": "Thailand",
            "startDate": "2024-01-06",
            "duration": "18 days",
            "description": "Crossing into Thailand was a whole new vibe! First, we had to sort out our phone lines and then navigate Thai immigration with some language hiccups. Everything was in Thai, the electric cables were a mess, and McDonald's was shockingly expensive compared to Malaysia. The roads, though, were silky smooth, making cycling feel safe despite the scorching heat and strong headwinds that slowed us down. We loved how clean the petrol station toilets were too. We quickly learned that credit cards aren't as widely accepted here as in Europe, so finding an ATM with a hefty fee was a must. After a week of non-stop cycling, we felt a bit burnt out and longed for a rest day. We saw some wild things on the roads, especially pickup trucks carrying everything from cows to entire huts, driven pretty recklessly. We had a chill rest day in Tha Kram, catching up on videos and bike maintenance. One morning, Mei Yee's tire got a puncture, and we became 'experts' at changing tubes, even if it took us an hour initially. The locals were super friendly, offering us free drinks and food, and even inviting us to stay at a temple. Some days were just tough with heavy rain or endless hilly 'deep V' roads that really tested our limits. We also found out about the local love for loud karaoke and saw orange trees for the first time. Sadly, we discovered the public sale of dog and cat meat, which was pretty disheartening. After tackling some seriously hilly terrain, we finally made it to the border, exhausted but excited to head to Laos."
        },
        {
            "country": "Laos",
            "startDate": "2024-01-24",
            "duration": "5 days",
            "description": "Our first taste of Laos involved a bus ride across the Mekong River and arriving in Thakhek, which was surprisingly better than we expected. We quickly realised it was a hub for foreigners doing 'the loop' by motorbike. We enjoyed delicious pork noodles for breakfast and stocked up on snacks at the local market, which was a mix of Thai and Chinese products. Cycling here meant dealing with no public toilets, so bushes or abandoned petrol stations became our restrooms. The mountains offered some truly beautiful views, but the roads often lacked lines, and other vehicles would sometimes drift into our lane. We met some incredible touring bikers, some who had been cycling for 18 months around the world, which made us feel like total newbies! One night, we ended up in a shabby guesthouse with no hot water, and the owner tried to upsell us on hot springs – quite the experience. The shopkeeper near the border warned us it would be super cold, and he wasn't wrong! Crossing into Vietnam was a misty, drizzling, uphill battle that left us drenched and shivering. Laos was an adventure, but definitely a challenging one on a bike!"
        },
        {
            "country": "Vietnam",
            "startDate": "2024-01-28",
            "duration": "7 days",
            "description": "Leaving Laos, we hit Vietnam, and immediately noticed the chaotic driving style—drivers don't stop at junctions, constantly honk, and overtake from the slow lane like bosses. Getting used to it was a bit stressful at first! We were excited to see Chinese New Year decorations everywhere, especially the beautiful plum blossoms. We also discovered a love for Banh Mi, Vietnam's delicious version of Subway. The roads were often terrible, making for slow, muddy, and dusty rides. What really hit us hard was seeing the public sale of dog and cat meat; it was truly disappointing to see our 'next friends' on menus. We also found out that Google Maps isn't always accurate here, especially when looking for restaurants. Laundry was a challenge too; hotels often relied on natural drying, which wasn't ideal in the rain. Despite the tough conditions, we saw beautiful mountains, paddy fields, and orange trees, and were amazed by how much Vietnamese people can carry on their motorbikes. We met a friendly retired couple running a guesthouse, who offered us a discount code and treated us like family. Our journey through Vietnam was a mix of beautiful scenery, challenging roads, and some sad cultural observations, but we were ready for China!"
        },
        {
            "country": "China",
            "startDate": "2024-02-05",
            "duration": "62 days",
            "description": "Entering China was an eye-opener! Hekou was surprisingly developed with nice bicycle lanes. The constant police checkpoints, roadblocks, and passport checks were a bit unnerving, making us feel like we were always being watched. We quickly learned to use WeChat Pay (after some struggle) and were amazed by the variety of snacks in convenience stores. Yunnan province was full of winding mountain roads and spectacular views. We found ourselves pushing our bikes up incredibly steep gravel roads, which was exhausting, but the scenery was breathtaking. China gave us a lot of firsts: seeing mountains capped with snow, smelling poop everywhere in some villages, and discovering that hotels could be units in condominiums. We even met a kind old man living a nomad life, who had cycled all over China for six years. Our trip took an unexpected turn when my dry eyes worsened after cycling to high elevations, forcing us to pause the trip and fly back to Malaysia for treatment. But we were back on the bikes a month later, ready to continue! We navigated more unpredictable weather, including sandstorms and freezing temperatures, which sometimes forced us into expensive hotels or to rely on the kindness of strangers for rides. We admired the impressive wind farms and vast desert landscapes, even though it meant battling strong headwinds and truck-induced wind gusts. The food was a highlight, from delicious hotpot to cheap beef noodles, though we had some interesting discoveries like salty milk tea. We also noticed some unique cultural aspects, like people preparing huge sums for weddings and students studying for 10 hours a day. Xinjiang proved challenging with more checkpoints and police escorts, making us feel constantly tracked, but the views of snow-capped mountains and grasslands were incredible. Despite the difficulties, China was an unforgettable experience, pushing our limits and showing us immense beauty and hospitality, before we took a bus to Kazakhstan!"
        },
        {
            "country": "Kazakhstan",
            "startDate": "2024-04-30",
            "duration": "23 days",
            "description": "Kazakhstan welcomed us with Google Translate as our main form of communication and a new currency, Tenge. We quickly made a cycling friend, Bruce, who was heading the same way, and his navigation skills were a lifesaver, pointing out potholes I often missed. The landscape was a mix of green grasslands and vast deserts, with our first sight of desert dunes. The roads were sometimes bumpy, but others were smooth like highways, though we often battled strong headwinds that slowed us to a crawl. Finding food and toilets outside of towns was a real challenge, often meaning we had to pack our own lunches and resort to bushes. We had some great food, including massive meat skewers and milk with a surprisingly strong cow odor. We were lucky to be hosted by Matt, an Englishman in Almaty, who was preparing for an ultra marathon and showed us around the city, including the bustling Green Bazaar and the wooden Ascension Cathedral. We even met fellow Malaysians there, which was a nice surprise! After leaving Almaty, we faced more challenging weather, with rain, mud, and more snow-capped mountains appearing. The local people were incredibly friendly, often cheering us on and even giving us food. However, my bike stand decided to break, and we faced more construction and gravel roads. Our journey through the desert was particularly brutal, with scorching temperatures, intense headwinds, and long stretches with no services. We learned to carry 13 liters of water daily and endured sleepless, mosquito-filled nights. Despite the hardships, the stunning wavy grasslands and the kindness of strangers, like the shepherd who offered us shelter, made it a truly memorable and enjoyable part of our trip. We finally made it out of the desert, exhausted but proud, and flew to Azerbaijan!"
        },
        {
            "country": "Kyrgyzstan",
            "startDate": "2024-05-08",
            "duration": "3 days",
            "description": "Entering Kyrgyzstan from Kazakhstan was straightforward at the border, but the roads immediately turned rough. Bishkek, the capital, wasn't huge, and we ended up having dinner at KFC because it was surprisingly cheap. We even wasted two hours cycling in the wrong direction one morning due to the uneven terrain. The 'country' had an interesting mix of old cars, with both left and right-hand drives, which felt a bit peculiar. Communication was tough, as Google Translate often failed us with Russian, but we still enjoyed some unique dishes like rice with mashed potatoes and macaroni. The roads were consistently bad, making us feel like we were riding horses, but at least there weren't many trucks. Before leaving, we spent our remaining Kyrgyzstan som on 11 pairs of sneakers! We had a slightly uncomfortable experience at the border with a drunk old man trying to kiss Mei Yee, but thankfully we got through quickly. After a short stint, we re-entered Kazakhstan."
        },
        {
            "country": "Uzbekistan",
            "startDate": "2024-05-15",
            "duration": "20 days",
            "description": "Uzbekistan welcomed us with much better roads than the other 'stan' countries we'd visited, at least initially. Tashkent had an iconic tower, and we stayed at a vibrant Art Hostel filled with fellow backpackers. We spent a few days exploring Tashkent, an Islamic 'country' rich in Silk Road history, visiting grand mosques, museums, and beautifully themed subway stations. A retired hotel manager taught us all about local food, which was fascinating. Unfortunately, the roads quickly deteriorated outside the capital, with countless potholes and uneven surfaces. We saw many birds, especially storks, building nests on electrical grids, which we learned is their national symbol, though it seemed a dangerous spot. We often ran low on cash, so paid toilets were out, and bushes became our default. But the highlight was the incredible hospitality! We received free meals, drinks, and even money from generous locals who insisted on helping us, despite language barriers. Bukhara was a truly unique and well-preserved ancient city that felt like stepping into Aladdin's world, with all its historical monuments. Preparing for the desert crossing was serious business: early starts, carrying 8 liters of water, and enough food for two days. Cycling through the Ustyurt Plateau desert was brutally hot, making us regret late starts and forcing us to finish cycling before 2 p.m. We met a 72-year-old Uzbek man cycling to Makkah, who inspired us. The desert journey was challenging with strong winds and long stretches of nothing, but the kindness of strangers, like the farmer who gave us water, always shone through. We finally said goodbye to Uzbekistan, appreciating the friendly people despite the tough conditions, and re-entered Kazakhstan for the final desert push to Aktau."
        },
        {
            "country": "Azerbaijan",
            "startDate": "2024-06-12",
            "duration": "6 days",
            "description": "Flying into Baku felt like landing in a modern, Westernized city, though the roads were frustratingly similar to Malaysia's chaotic traffic. Baku is a UNESCO World Heritage site with city walls and an old town, but with luxury shops that made it feel much more modern than Khiva. Food here was pricey, on par with Europe, so we quickly learned to be frugal and eat at the hostel. Leaving the city, the landscape quickly turned to desert, and we even spotted points of interest like a volcano. Local hospitality was still strong, with a kind petrol station worker giving us free petrol and cold water. We experienced some 'menu-less' restaurants where the waiter became the menu, hilariously describing chicken as 'pak pak pak pak'. My internet roaming bill shot up unexpectedly, which was a pain. We had a strange encounter with a man at a rest area who kept trying to take pictures with Mei Yee alone, which was quite creepy. One night, my slipper was even stolen and chewed by a naughty dog! Finding camping spots could be tough, but we managed to find shelter under a storeroom or even in a mosque, which was a first for us. Azerbaijan had beautiful mountain views, especially as we headed towards Torul, but the uphill cycling was intense. Crossing into Georgia involved a quick chat with a policeman who couldn't pronounce our names and thought we were Japanese, before letting us go without much fuss. Azerbaijan was a brief but memorable stop on our journey!"
        },
        {
            "country": "Georgia",
            "startDate": "2024-06-17",
            "duration": "9 days",
            "description": "Our first impression of Georgia wasn't great – a lot of rubbish and bad roads – but that quickly changed when we saw the beautiful grasslands full of flowers. Tbilisi, the capital, totally amazed us with its stunning buildings and landscapes, blending diverse architecture and vibrant culture. We spent a few days exploring, taking cable cars to Narikala Fortress, enjoying Georgian food, and strolling through the old town. We even learned that Malaysians can stay in Georgia for a year without a visa, which is pretty cool! Cycling out of Tbilisi meant battling cobblestone streets, hilly terrain, and drivers who sometimes reversed without warning. We faced strong headwinds and some rainy showers, but the scenic views of grasslands and wind turbines always kept our spirits up. We had some delicious local food, like wrapped kebabs and khachapuri, which is like a cheesy pizza. We cycled through long tunnels, some still under construction by a Chinese company, where the workers were surprised to see us. Finally, we reached the Black Sea, camping by the beach which was absolutely beautiful. Our last day in Georgia involved deciding on our route in Turkey after talking to a French bikepacker, and then smoothly crossing the border into Turkey, sad to leave such a beautiful 'country'."
        },
        {
            "country": "Turkey",
            "startDate": "2024-06-25",
            "duration": "19 days",
            "description": "Our journey through Turkey began with a smooth border crossing, but we quickly realized hotel prices were much higher than expected, so we opted for campsites. We also found that ATMs charged a hefty 9% transaction fee, so using credit cards became our default. After a day of rain, we hit the road under the sun, cycling by the seaside, which was incredibly stress-reducing. I had a bit of a mishap, taking a 360-degree backflip off my bike after a rack nut snapped, but luckily, I was mostly fine, and some kind strangers stopped to help. We even got to sleep in a mosque for the first time, which was a unique experience! The mountain views were truly spectacular, with pine trees decorating the landscape. We cycled through the longest tunnel yet, a 14km stretch that felt futuristic with blue LED lights. We met some friendly locals who taught us Turkish words and shared mountain spring water. The uphill climbs were intense, with gradients up to 16%, often accompanied by headwinds, making downhill cycling feel like uphill. We learned to love 'kahvaltı,' a classic Turkish breakfast with many small dishes. We saw vast wheat and sunflower farms, learning about the harvesting process. Unfortunately, we had a bad experience with an overpriced tourist restaurant, but other local spots offered delicious, reasonably priced food like grilled chicken and burgers. My gear started falling apart, from shoes to gloves to phone holders, and I even had an issue with my internet bill soaring from auto-subscriptions. We cycled along stunning coastlines, and even stumbled upon a UNESCO site with interesting rock formations. The heat was often extreme, reaching 39 degrees Celsius. After a few police stops for cycling on highways, we made it to Cesme, where we spent our last Turkish Lira on food and water, camping by the seaside amidst loud party music. We then took a ferry to Greece, ready for the next leg of our adventure!"
        },
        {
            "country": "Greece",
            "startDate": "2024-07-14",
            "duration": "5 days",
            "description": "Our entry into Greece was by ferry from Turkey to Chios, where customs were smooth, marking our arrival in Europe. Mei Yee wasn't feeling great, and to make things tougher, all the shops were closed on Sunday, so no internet SIM for me. We then took another ferry to Athens, arriving after a sleepless night, but excited to explore the historic city. Athens was a true marvel, a 'museum by itself,' with the Acropolis as its standout feature, and we spent days walking around, soaking in its history and visiting sites like the Temple of Zeus and the Ancient Agora. We even learned the origin of the marathon distance! It was scorching hot, with a heatwave hitting after our visit, luckily we missed the closures. Cycling out of Athens early was key to avoid the heat, and the journey along the coastline was beautiful. The locals were friendly, often showing concern about us cycling in the heat. Our time in Greece ended with a ferry ride from Patras to Italy, which felt similar to our previous ferry, but this one even had a casino!"
        },
        {
            "country": "Italy",
            "startDate": "2024-07-19",
            "duration": "17 days",
            "description": "Italy greeted us with a refreshing 'power sleep' on the ferry, but also with more heat, though it was bearable. We quickly learned that most restaurants open around noon, and we couldn't do wild camping, so finding affordable B&Bs or hostels became our mission. The 'countryside' roads were often beautiful, especially the famous cycling route, Giro Ad Anello, which felt like it was all ours. Italian drivers were incredibly considerate, patiently waiting for us at junctions. However, Google Maps sometimes led us astray onto challenging gravel roads or even closed restaurants. Public toilets were a rarity, leading to some uncomfortable moments. Rome was truly unique, like 'a museum by itself,' and we spent two exhausting but spectacular days exploring its ancient wonders. We found that Italy is full of stunning ancient cities built on hills, like Orvieto, which made for beautiful views but tough climbs. Our journey continued through picturesque grape and olive farms, and we even got to see apple and kiwi trees for the first time! The 'Sun Route' (EuroVelo 7) was amazing, offering dedicated cycling paths along the Adige River with castles and fruit farms, making it our favorite route so far. We indulged in delicious Italian food, especially spaghetti bolognese. Finding accommodation during summer holidays could be tricky, with hostels fully booked. We even rented a motorbike to explore the Dolomites, a stunning mountain range, realizing we needed more time to truly experience it. We had some funny moments, like a kind lady stopping traffic to offer us hospitality and being confused by our pronunciation of 'Alife'. Our final days in Italy were spent pushing up incredibly steep inclines to Monte Piano, heading towards Bologna, before eventually reaching Verona and Venice, both incredibly beautiful and unique cities."
        },
        {
            "country": "Austria",
            "startDate": "2024-08-07",
            "duration": "4 days",
            "description": "Our short stint in Austria started with a cold night and a desperate search for a campsite after a sleepless night at Innsbruck station. Waking up to spectacular snow-capped mountains made us regret cycling at night and missing the views. We managed to snag a cheap spot at a paid campsite and spent a rest day exploring Innsbruck, a charming town in the Alps. Heading towards Germany, we faced a brutal 16% incline on a gravel bicycle lane, which turned out to be the steepest climb of our trip, forcing us to push our bikes. Reaching the peak, we were rewarded with the stunning, pristine blue waters of Achensee lake. Austria, though brief, was a beautiful and challenging climb before we rolled into Germany."
        },
        {
            "country": "Germany",
            "startDate": "2024-08-10",
            "duration": "19 days",
            "description": "Germany welcomed us with rain, delaying our departure from Munich, where we enjoyed a delicious breakfast from our friends. We explored Munich's lakes by bike and sampled local delights like pork knuckle and Currywurst. We even got to visit the Google office and explored Mozart's hometown, Salzburg. Cycling through Germany meant dealing with dedicated but often bumpy bike lanes, and the occasional slug on the road. We found ourselves camping in random forests or parks, sometimes waking up to cold temperatures or even a loud fart from a neighboring tent! Nuremberg surprised us with its beauty, especially the 'Married-Go-Round' statue. We met kind locals who offered help and a place to stay, reminding us of Malaysian hospitality. The Thuringian Forest was hilly but well-maintained, though Google Maps sometimes led us into wheat fields with no actual roads. We learned that some places don't accept credit cards, so having cash was important. We cycled through Volkswagen City (Wolfsburg), then along rivers, often battling strong headwinds. One campsite receptionist had a peculiar way of complimenting us, saying 'Something fell on the ground, and it told me good people would come today. And those people are you'. We had a tire puncture after running over broken glass, but a kind security officer helped us navigate a bridge under maintenance by taking a ferry. Our final stretch in Germany involved savoring the beautiful towns and landscapes before a smooth, unchecked border crossing into Denmark, our final 'country'!"
        },
        {
            "country": "Denmark",
            "startDate": "2024-08-28",
            "duration": "3 days",
            "description": "Our final 'country', Denmark, began with a comfortable stay at our friend Kim's fancy house after a long ride. We enjoyed a relaxed morning, even saying hello to former colleagues during Kim's video call. The roads in Denmark were generally straightforward, making for quicker cycling, and we appreciated the numerous rest areas with toilets. We passed through Odense, learning the correct pronunciation ('U-en-se'). A heartwarming moment was visiting our former colleague Charlotte and deciding to give her our bikes, as shipping them back would be too expensive. Our journey ended with a final campsite stay, preparing for the last push to Copenhagen, excited to finally reach our destination!"
        }
    ]
}